In [1]:
import pandas as pd

In [2]:
# Pandas data stuctures are Series Data Frame

In [3]:
s= pd.Series([11,22,33,44,55,66,77])

In [5]:
s # serise object first colume (Default index ya label) and second colume are value

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64

In [7]:
# Accessing Data from seres
s[5] #single value access

66

In [9]:
s[[5,0]] # access mulitple vaues

5    66
0    11
dtype: int64

In [14]:
# updating value
s[[4,5]]=[444,555]

In [15]:
s

0     11
1     22
2     33
3     44
4    444
5    555
6     77
dtype: int64

In [16]:
del s[4]

In [17]:
s

0     11
1     22
2     33
3     44
5    555
6     77
dtype: int64

In [18]:
del [[5,6]]

SyntaxError: can't delete literal (<ipython-input-18-d51d25cced6c>, line 1)

In [21]:
s[7]=777 # insert the new value

In [20]:
s

0     11
1     22
2     33
3     44
5    555
6     77
7    777
dtype: int64

In [22]:
s[[8,9]] = [888, 999] # cant do muiltiple insert

ValueError: [8 9] not contained in the index

In [23]:
s

0     11
1     22
2     33
3     44
5    555
6     77
7    777
dtype: int64

In [25]:
s1 = pd.Series([100,200,300,400],index=["apples","Oranges", "Bananas", "Kiwis"])

In [26]:
s1

apples     100
Oranges    200
Bananas    300
Kiwis      400
dtype: int64

In [30]:
ourindex = ["Peach","apples","Oranges", "Bananas","Grapes"]

In [31]:
s2= pd.Series(s1,index=ourindex)

In [33]:
s2

Peach        NaN
apples     100.0
Oranges    200.0
Bananas    300.0
Grapes       NaN
dtype: float64

s1

In [34]:
s1

apples     100
Oranges    200
Bananas    300
Kiwis      400
dtype: int64

In [35]:
s2

Peach        NaN
apples     100.0
Oranges    200.0
Bananas    300.0
Grapes       NaN
dtype: float64

In [36]:
s2>100

Peach      False
apples     False
Oranges     True
Bananas     True
Grapes     False
dtype: bool

In [38]:
s2[s2>100] # this will return the true value

Oranges    200.0
Bananas    300.0
dtype: float64

In [39]:
"Oranges" in s2

True

# Creating a serise using a dictinary

In [45]:
Sdata = {'ohio': 35000,'Tezas':71000 ,"Orege": 16000}

In [46]:
Sdata

{'ohio': 35000, 'Tezas': 71000, 'Orege': 16000}

In [47]:
s3= pd.Series(Sdata)

In [48]:
s3

ohio     35000
Tezas    71000
Orege    16000
dtype: int64

## Date Frame Set

In [63]:
df = pd.DataFrame(["Red","Green","Blue"])

In [71]:
df

       0
0    Red
1  Green
2   Blue

In [72]:
df1 = pd.DataFrame(["Red","Green","Blue"],index=["v1","v2","v3"], columns=["C1"]) # index and colume given

In [73]:
df1

       C1
v1    Red
v2  Green
v3   Blue

## Creating a frame using a dictionay

In [116]:
dic= {"Ai for EO":[90,89,87,81,76,78,79,90,71,67],
      "Python1":[67,87,56,75,81,90,67,45,98,67],
      "Python2":[78,89,76,78,56,98,45,71,70,45]
     }
studentName = ["Ali","Ahmed","Nasir","Asad","Khan","Saad","Fahad","Usman","Talha","Fazal"]

In [117]:
data = pd.DataFrame(dic,index=studentName)

In [118]:
data

       Ai for EO  Python1  Python2
Ali           90       67       78
Ahmed         89       87       89
Nasir         87       56       76
Asad          81       75       78
Khan          76       81       56
Saad          78       90       98
Fahad         79       67       45
Usman         90       45       71
Talha         71       98       70
Fazal         67       67       45

In [119]:
data.Python1

Ali      67
Ahmed    87
Nasir    56
Asad     75
Khan     81
Saad     90
Fahad    67
Usman    45
Talha    98
Fazal    67
Name: Python1, dtype: int64

In [120]:
data["Python1"]["Nasir"]

56

In [123]:
data.loc["Nasir"]

Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64

In [130]:
data.loc["Nasir"]["Ai for EO":"Python2"] # Note in this slicing this will not neglatong Python2

Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64

In [132]:
data.iloc[2]["Ai for EO":"Python2"] # iloc

Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64

In [144]:
data.loc["Ali":"Ahmed"]

       Ai for EO  Python1  Python2
Ali           90       67       78
Ahmed         89       87       89

In [147]:
data.loc["Ali":"Saad"][["Ai for EO","Python2"]]  ##note in this thr will be two square barckets in colume

       Ai for EO  Python2
Ali           90       78
Ahmed         89       89
Nasir         87       76
Asad          81       78
Khan          76       56
Saad          78       98

In [151]:
data.iloc[0:6][["Ai for EO","Python2"]] ## in iloc

       Ai for EO  Python2
Ali           90       78
Ahmed         89       89
Nasir         87       76
Asad          81       78
Khan          76       56
Saad          78       98

In [153]:
data["extra"] = 45 ## adding new colume
data

       Ai for EO  Python1  Python2  extra
Ali           90       67       78     45
Ahmed         89       87       89     45
Nasir         87       56       76     45
Asad          81       75       78     45
Khan          76       81       56     45
Saad          78       90       98     45
Fahad         79       67       45     45
Usman         90       45       71     45
Talha         71       98       70     45
Fazal         67       67       45     45

In [155]:
data["extra"] = range(10)
data

       Ai for EO  Python1  Python2  extra
Ali           90       67       78      0
Ahmed         89       87       89      1
Nasir         87       56       76      2
Asad          81       75       78      3
Khan          76       81       56      4
Saad          78       90       98      5
Fahad         79       67       45      6
Usman         90       45       71      7
Talha         71       98       70      8
Fazal         67       67       45      9

In [158]:
data["extra"] = [23,56,89,56,89,78,23,12,14,22]
data

       Ai for EO  Python1  Python2  extra
Ali           90       67       78     23
Ahmed         89       87       89     56
Nasir         87       56       76     89
Asad          81       75       78     56
Khan          76       81       56     89
Saad          78       90       98     78
Fahad         79       67       45     23
Usman         90       45       71     12
Talha         71       98       70     14
Fazal         67       67       45     22

In [163]:
data["Total"] = data["Ai for EO"]+data["Python1"]+data["extra"]+data["Python2"]
data

       Ai for EO  Python1  Python2  extra  Total
Ali           90       67       78     23    258
Ahmed         89       87       89     56    321
Nasir         87       56       76     89    308
Asad          81       75       78     56    290
Khan          76       81       56     89    302
Saad          78       90       98     78    344
Fahad         79       67       45     23    214
Usman         90       45       71     12    218
Talha         71       98       70     14    253
Fazal         67       67       45     22    201

In [164]:
data.index

Index(['Ali', 'Ahmed', 'Nasir', 'Asad', 'Khan', 'Saad', 'Fahad', 'Usman',
       'Talha', 'Fazal'],
      dtype='object')

In [165]:
data.columns

Index(['Ai for EO', 'Python1', 'Python2', 'extra', 'Total'], dtype='object')

In [169]:
data.values

array([[ 90,  67,  78,  23, 258],
       [ 89,  87,  89,  56, 321],
       [ 87,  56,  76,  89, 308],
       [ 81,  75,  78,  56, 290],
       [ 76,  81,  56,  89, 302],
       [ 78,  90,  98,  78, 344],
       [ 79,  67,  45,  23, 214],
       [ 90,  45,  71,  12, 218],
       [ 71,  98,  70,  14, 253],
       [ 67,  67,  45,  22, 201]], dtype=int64)

In [173]:
data.shape

(10, 5)

In [176]:
data.keys()

Index(['Ai for EO', 'Python1', 'Python2', 'extra', 'Total'], dtype='object')

In [177]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Ali to Fazal
Data columns (total 5 columns):
Ai for EO    10 non-null int64
Python1      10 non-null int64
Python2      10 non-null int64
extra        10 non-null int64
Total        10 non-null int64
dtypes: int64(5)
memory usage: 800.0+ bytes

In [178]:
data.describe()

       Ai for EO    Python1    Python2      extra       Total
count  10.000000  10.000000  10.000000  10.000000   10.000000
mean   80.800000  73.300000  70.600000  46.200000  270.900000
std     8.134973  16.186757  17.487774  31.154811   49.408614
min    67.000000  45.000000  45.000000  12.000000  201.000000
25%    76.500000  67.000000  59.500000  22.250000  226.750000
50%    80.000000  71.000000  73.500000  39.500000  274.000000
75%    88.500000  85.500000  78.000000  72.500000  306.500000
max    90.000000  98.000000  98.000000  89.000000  344.000000

In [183]:
data.head() # show five start rows by default 5

       Ai for EO  Python1  Python2  extra  Total
Ali           90       67       78     23    258
Ahmed         89       87       89     56    321
Nasir         87       56       76     89    308
Asad          81       75       78     56    290
Khan          76       81       56     89    302

In [184]:
data.tail()  # show five last rows by default 5

       Ai for EO  Python1  Python2  extra  Total
Saad          78       90       98     78    344
Fahad         79       67       45     23    214
Usman         90       45       71     12    218
Talha         71       98       70     14    253
Fazal         67       67       45     22    201

In [188]:
data["status"] = 'Pass' if data["Total"]>150 else 'Fail'
data

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [192]:
data["status"] = data["Total"]>275
data

       Ai for EO  Python1  Python2  extra  Total  status
Ali           90       67       78     23    258   False
Ahmed         89       87       89     56    321    True
Nasir         87       56       76     89    308    True
Asad          81       75       78     56    290    True
Khan          76       81       56     89    302    True
Saad          78       90       98     78    344    True
Fahad         79       67       45     23    214   False
Usman         90       45       71     12    218   False
Talha         71       98       70     14    253   False
Fazal         67       67       45     22    201   False

In [196]:
data["status"] = ["Pass" if i > 275 else "Fail" for i in data['Total']]
data

       Ai for EO  Python1  Python2  extra  Total status
Ali           90       67       78     23    258   Fail
Ahmed         89       87       89     56    321   Pass
Nasir         87       56       76     89    308   Pass
Asad          81       75       78     56    290   Pass
Khan          76       81       56     89    302   Pass
Saad          78       90       98     78    344   Pass
Fahad         79       67       45     23    214   Fail
Usman         90       45       71     12    218   Fail
Talha         71       98       70     14    253   Fail
Fazal         67       67       45     22    201   Fail

In [197]:
data["status"] ="PAss" if (data["Ai for EO"]+data["Python1"]+data["extra"]+data["Python2"]) > 275 else "FAil"
data

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [198]:
data

       Ai for EO  Python1  Python2  extra  Total status
Ali           90       67       78     23    258   Fail
Ahmed         89       87       89     56    321   Pass
Nasir         87       56       76     89    308   Pass
Asad          81       75       78     56    290   Pass
Khan          76       81       56     89    302   Pass
Saad          78       90       98     78    344   Pass
Fahad         79       67       45     23    214   Fail
Usman         90       45       71     12    218   Fail
Talha         71       98       70     14    253   Fail
Fazal         67       67       45     22    201   Fail

In [202]:
dic2= {"Ai for EO":[90,89,5,81,76,5,79,90,5,67],
      "Python1":[67,87,56,75,81,90,67,45,98,67],
      "Python2":[78,89,76,5,56,98,45,71,70,45]
     }
studentName2 = ["Ali","Ahmed","Nasir","Asad","Khan","Saad","Fahad","Usman","Talha","Fazal"]
data2 = pd.DataFrame(dic2,index=studentName2)

In [203]:
data2

       Ai for EO  Python1  Python2
Ali           90       67       78
Ahmed         89       87       89
Nasir          5       56       76
Asad          81       75        5
Khan          76       81       56
Saad           5       90       98
Fahad         79       67       45
Usman         90       45       71
Talha          5       98       70
Fazal         67       67       45

In [205]:
data2["Total"] = data2["Ai for EO"]+data2["Python1"]+data2["Python2"]
data2

       Ai for EO  Python1  Python2  Total
Ali           90       67       78    235
Ahmed         89       87       89    265
Nasir          5       56       76    137
Asad          81       75        5    161
Khan          76       81       56    213
Saad           5       90       98    193
Fahad         79       67       45    191
Usman         90       45       71    206
Talha          5       98       70    173
Fazal         67       67       45    179

In [210]:
data2["singlePaperStatus"] = data["Ai for EO"]  > 50 
data2

       Ai for EO  Python1  Python2  Total  singlePaperStatus
Ali           90       67       78    235               True
Ahmed         89       87       89    265               True
Nasir          5       56       76    137               True
Asad          81       75        5    161               True
Khan          76       81       56    213               True
Saad           5       90       98    193               True
Fahad         79       67       45    191               True
Usman         90       45       71    206               True
Talha          5       98       70    173               True
Fazal         67       67       45    179               True